# Distributions

### Introduction

So in the last few lessons, we saw how to apply the 80 - 20 rule across categorical data.  We saw that oftentimes, our key metric is not spread evenly across categories.  And that this is a good thing -- it allows us to direct our focus.  

In this lesson, we'll see how we can use the 80 - 20 principle when working with even more granular data, like individual customers.

In [11]:
import warnings
warnings.simplefilter(action='ignore')
import pandas as pd
url = "https://raw.githubusercontent.com/tech-interviews-jigsaw/data-analysis-takehomes/main/1-approaches-for-problems/ecommerce-dataset.csv"
df = pd.read_csv(url)

In [12]:
df[:3]

,Transaction_id,customer_id,Date,Product,Gender,Device_Type,Country,State,City,Category,Customer_Login_type,Delivery_Type,Quantity,Transaction Start,Transaction_Result,Amount US$,Individual_Price_US$,Year_Month,Time
0,40170,1348959766,14/11/2013,Hair Band,Female,Web,United States,New York,New York City,Accessories,Member,one-day deliver,12,1,0,"6,910",576,13-Nov,22:35:51
1,33374,2213674919,05/11/2013,Hair Band,Female,Web,United States,California,Los Angles,Accessories,Member,one-day deliver,17,1,1,"1,699",100,13-Nov,06:44:41
2,14407,1809450308,01/10/2013,Hair Band,Female,Web,United States,Washington,Seattle,Accessories,Member,Normal Delivery,23,1,0,"4,998",217,13-Oct,00:41:24

[Power Users lesson](https://colab.research.google.com/github/tech-interviews-jigsaw/data-analysis-takehomes/blob/main/1-approaches-for-problems/7-power-users.ipynb#scrollTo=tQRM8Z24TDFI)

[Analyzing Power Users](https://colab.research.google.com/github/tech-interviews-jigsaw/data-analysis-takehomes/blob/main/1-approaches-for-problems/8-analyzing-power-users.ipynb#scrollTo=2e41cf41-7e36-4a97-ae58-427d4a436560)

### Superstore dataset

[Superstore Marketing Campaign](https://www.kaggle.com/datasets/ahsan81/superstore-marketing-campaign-dataset)

In [ ]:
###

In [10]:
import pandas as pd
file = 'superstore_data.csv'
df = pd.read_csv(file)
df[:3]

,Id,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,MntFishProducts,MntSweetProducts,MntGoldProds,NumDealsPurchases,NumWebPurchases,NumCatalogPurchases,NumStorePurchases,NumWebVisitsMonth,Response,Complain
0,1826,1970,Graduation,Divorced,84835.0,0,0,6/16/2014,0,189,...,111,189,218,1,4,4,6,1,1,0
1,1,1961,Graduation,Single,57091.0,0,0,6/15/2014,0,464,...,7,0,37,1,7,3,7,5,1,0
2,10476,1958,Graduation,Married,67267.0,0,1,5/13/2014,0,134,...,15,2,30,1,3,2,5,2,0,0

In [3]:
import pandas as pd
file = '2020-Jan.csv'
df = pd.read_csv(file)

In [5]:
df.event_type.value_counts()

view                2037608
cart                1148323
remove_from_cart     815024
purchase             263797
Name: event_type, dtype: int64

In [6]:
df_purchased = df[df['event_type'] == 'purchase']
df_purchased[:3]

,event_time,event_type,product_id,category_id,category_code,brand,price,user_id,user_session
60,2020-01-01 00:06:07 UTC,purchase,5802440,2151191070908613477,NaN,NaN,2.16,595411904,74ca1cd5-5381-4ffe-b00b-a258b390db77
61,2020-01-01 00:06:07 UTC,purchase,5825203,2089259162625114209,NaN,kiss,7.92,595411904,74ca1cd5-5381-4ffe-b00b-a258b390db77
590,2020-01-01 00:51:38 UTC,purchase,5842655,1487580013841613016,NaN,NaN,14.51,595351517,4ceb1e27-416e-4a3c-972a-03eb373d67b2

In [9]:
df_purchased['user_id'].value_counts(ascending = False, normalize = True)

469299888    0.000997
556579890    0.000982
507727824    0.000974
596971707    0.000967
600721252    0.000887
               ...
544502140    0.000004
546426019    0.000004
601017333    0.000004
607562807    0.000004
321790519    0.000004
Name: user_id, Length: 28220, dtype: float64

### Loading our data

[Ecommerce Cosmetics Shop](https://www.kaggle.com/datasets/mkechinov/ecommerce-events-history-in-cosmetics-shop).